brianwarner/esp32-co2/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 4 MB flash, single app
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# ESP32-S3 SuperMini exposes the native USB port (GPIO19/20)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# Re-poll NTP once per hour
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000
